/**
 * @Intoduction
 *
 * Нужно реализовать веб-приложение которое будет получать данные с http сервера
 *
 * @Requirements
 * Разрешенные npm пакеты уже установлены и настроены
 * Разработать сайт нужно по технологии FSD (Feature slice design)
 *
 * @Links
 * [
 *  https://github.com/tensenrey/introduction [Все нужные ссылки тут есть]
 * ]
 *
 * @Task
 * Нужно написать веб-приложение с несколькими страницами
 * 1) Список приложений + функция создания нового
 *  Отображаем карточку с этими данными (Название, дата создания, id  в системе, кнопка для перехода в приложение)
 * 
 * 2) Страница приложения (по клику на карточку приложения из списка должна открываться страница выбранного приложения)
 *   Тут мы можем редактировать приложение (Редактировать можно только название!)
 *   И удалять его
 * 
 * Приложение должно полнотью взаимодействовать с вашим сервером!
 * Локально ничего не храним и не создаем
 * 
 * !!!!Дизайн делаете на свой вкус и цвет!!!!!
 * =============================
 */
